def ks_to_en(ks):
    dK = { 0 : '', 1 : 'ΜΙΑ', 2 : 'ΔΥΟ', 3 : 'ΤΡΙΣ', 4 : 'ΤΕΣΣΕΡΗΣ', 5 : 'ΠΕΝΤΕ',
          6 : 'ΕΞΙ', 7 : 'ΕΠΤΑ', 8 : 'ΟΚΤΩ', 9 : 'ΕΝΝΕΑ', 10 : 'ΔΕΚΑ',
          11 : 'ΕΝΤΕΚΑ', 12 : 'ΔΩΔΕΚΑ', 13 : 'ΔΕΚΑΤΡΕΙΣ', 14 : 'ΔΕΚΑΤΕΣΣΕΡΙΣ',
          15 : 'ΔΕΚΑΠΕΝΤΕ', 16 : 'ΔΕΚΑΕΞΙ', 17 : 'ΔΕΚΑΕΠΤΑ', 18 : 'ΔΕΚΑΟΚΤΩ',
          19 : 'ΔΕΚΑΕΝΝΕΑ', 20 : 'ΕΙΚΟΣΙ',
          30 : 'ΤΡΙΑΝΤΑ', 40 : 'ΣΑΡΑΝΤΑ', 50 : 'ΠΕΝΗΝΤΑ', 60 : 'ΕΞΗΝΤΑ',
          70 : 'ΕΒΔΟΜΗΝΤΑ', 80 : 'ΟΓΔΟΝΤΑ', 90 : 'ΕΝΕΝΗΝΤΑ', 100 : 'ΕΚΑΤΟ'}
    k = 1000
    assert(0 <= ks and ks <=199)
    if (ks < 20):
        return dK[ks]

    if (ks < 100):
        if ks % 10 == 0: return dK[ks]
        else: return dK[ks // 10 * 10] + ' ' + dK[ks % 10]

    if (ks < k):
        if ks % 100 == 0: return dK[ks]
        else: return dK[ks // 100 * 100] + ' ' + int_to_en(ks % 100)

        




def int_to_en(num):


    d = { 0 : '', 1 : 'ΕΝΑ', 2 : 'ΔΥΟ', 3 : 'ΤΡΙΑ', 4 : 'ΤΕΣΣΕΡΑ', 5 : 'ΠΕΝΤΕ',
          6 : 'ΕΞΙ', 7 : 'ΕΠΤΑ', 8 : 'ΟΚΤΩ', 9 : 'ΕΝΝΕΑ', 10 : 'ΔΕΚΑ',
          11 : 'ΕΝΤΕΚΑ', 12 : 'ΔΩΔΕΚΑ', 13 : 'ΔΕΚΑΤΡΙΑ', 14 : 'ΔΕΚΑΤΕΣΣΕΡΑ',
          15 : 'ΔΕΚΑΠΕΝΤΕ', 16 : 'ΔΕΚΑΕΞΙ', 17 : 'ΔΕΚΑΕΠΤΑ', 18 : 'ΔΕΚΑΟΚΤΩ',
          19 : 'ΔΕΚΑΕΝΝΕΑ', 20 : 'ΕΙΚΟΣΙ',
          30 : 'ΤΡΙΑΝΤΑ', 40 : 'ΣΑΡΑΝΤΑ', 50 : 'ΠΕΝΗΝΤΑ', 60 : 'ΕΞΗΝΤΑ',
          70 : 'ΕΒΔΟΜΗΝΤΑ', 80 : 'ΟΓΔΟΝΤΑ', 90 : 'ΕΝΕΝΗΝΤΑ', 100 : 'ΕΚΑΤΟ', 200 : 'ΔΙΑΚΟΣΙΑ', 300 : 'ΤΡΙΑΚΟΣΙΑ', 400 : 'ΤΕΤΡΑΚΟΣΙΑ', 500 : 'ΠΕΝΤΑΚΟΣΙΑ', 600 : 'ΕΞΑΚΟΣΙΑ', 700 : 'ΕΠΤΑΚΟΣΙΑ', 800 : 'ΟΚΤΑΚΟΣΙΑ', 900 : 'ΕΝΝΙΑΚΟΣΙΑ', 1000 : 'ΧΙΛΙΑ' }
    
    


    k = 1000
    m = k * 1000

    assert(0 <= num)

    if (num < 20):
        return d[num]

    if (num < 100):
        if num % 10 == 0: return d[num]
        else: return d[num // 10 * 10] + ' ' + d[num % 10]

    if (num < k):
        if num % 100 == 0: return d[num]
        else: return d[num // 100 * 100] + ' ' + int_to_en(num % 100)

    if (num < m):
        if num // 1000 == 1: return "ΧΙΛΙΑ" + ' ' + int_to_en(num % k)
        elif num % k == 0: return ks_to_en(num // k) + ' ΧΙΛΙΑΔΕΣ'
        else: return ks_to_en(num // k) + ' ΧΙΛΙΑΔΕΣ, ' + int_to_en(num % k)



    raise AssertionError('num is too large: %s' % str(num))



